package utils

import (
	"regexp"
)

// IsValidCrontabRule 检查传入的字符串是否符合crontab的时间规则格式
func IsValidCrontabRule(rule string) bool {
	// Crontab时间规则通常由5个部分组成，每个部分由空格分隔
	// 分钟(0-59) 小时(0-23) 日期(1-31) 月份(1-12) 星期几(0-7)
	// 允许使用的特殊字符包括 * , - /
	// 此正则表达式用于匹配标准的crontab时间规则
	crontabRegex := `^(\*|([0-5]?[0-9](-[0-5]?[0-9])?)(,[0-5]?[0-9](-[0-5]?[0-9])?)*) ` +
		`(\*|([01]?[0-9]|2[0-3])(-([01]?[0-9]|2[0-3]))?(,([01]?[0-9]|2[0-3])(-([01]?[0-9]|2[0-3]))?)*) ` +
		`(\*|([1-9]|[12][0-9]|3[01])(-([1-9]|[12][0-9]|3[01]))?(,([1-9]|[12][0-9]|3[01])(-([1-9]|[12][0-9]|3[01]))?)*) ` +
		`(\*|([1-9]|1[012])(-([1-9]|1[012]))?(,([1-9]|1[012])(-([1-9]|1[012]))?)*) ` +
		`(\*|([0-7])(-([0-7]))?(,([0-7])(-([0-7]))?)*)$`
	match, _ := regexp.MatchString(crontabRegex, rule)
	return match
}
